python/BeginningPython2nd/c02.org
** 基本列表操作
   1. 说明：
      1. 元素赋值：使用索引标记来为某个特定的，位置明确的元素赋值；
      2. 元素删除：使用 *del* 语句；
      3. 分片赋值：
	 1. 可以一次为多个元素赋值；
	 2. 原片与新片可以长度不同；
	 3. 分片赋值可以在指定位置插入新的元素；
   2. 例子：
#+begin_src python
  >>> mylist = [1,2,3,4,5]

  #列表元素赋值
  >>> mylist[10] = 10
  Traceback (most recent call last):
    File "<pyshell#2>", line 1, in <module>
      mylist[10] = 10
  IndexError: list assignment index out of range
  >>> mylist[0] = 100
  >>> mylist
  [100, 2, 3, 4, 5]

  #删除元素
  >>> del(mylist[0])
  >>> mylist
  [2, 3, 4, 5]
  >>>

  #分片赋值
  >>> mystr = list("Nale Gunn")
  >>> mystr[0:4] = list("Bill")
  >>> mystr
  ['B', 'i', 'l', 'l', ' ', 'G', 'u', 'n', 'n']
  #分片赋值时，原片与新片长度不同
  >>> mystr=list("Bill Gunn")
  >>> mystr[-5:] = list("gunn@gmail.com")
  >>> mystr
  ['B', 'i', 'l', 'l', 'g', 'u', 'n', 'n', '@', 'g', 'm', 'a', 'i', 'l', '.', 'c', 'o', 'm']
  >>>
  #分片赋值可以在指定位置插入新的元素
  >>> mystr=list("Bill Gunn")
  >>> mystr[0:0] = list("My name is ")
  >>> mystr
  ['M', 'y', ' ', 'n', 'a', 'm', 'e', ' ', 'i', 's', ' ', 'B', 'i', 'l', 'l', ' ', 'G', 'u', 'n', 'n']
  >>>

#+end_src

