python/BeginningPython2nd/c02.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 基本列表操作 </h3>
<div class="outline-text-3" id="text-3-2">

<ol>
<li>说明：
<ol>
<li>元素赋值：使用索引标记来为某个特定的，位置明确的元素赋值；
</li>
<li>元素删除：使用 <b>del</b> 语句；
</li>
<li>分片赋值：
<ol>
<li>可以一次为多个元素赋值；
</li>
<li>原片与新片可以长度不同；
</li>
<li>分片赋值可以在指定位置插入新的元素；
</li>
</ol>

</li>
</ol>

</li>
<li>例子：
</li>
</ol>




<pre class="src src-python">&gt;&gt;&gt; mylist = [1,2,3,4,5]

<span style="color: #b22222;">#&#21015;&#34920;&#20803;&#32032;&#36171;&#20540;</span>
<span style="color: #b22222;">#&#32034;&#24341;&#24517;&#39035;&#22312;&#21015;&#34920;&#33539;&#22260;&#20869;</span>
&gt;&gt;&gt; mylist[10] = 10
Traceback (most recent call last):
  File <span style="color: #8b2252;">"&lt;pyshell#2&gt;"</span>, line 1, <span style="color: #a020f0;">in</span> &lt;module&gt;
    mylist[10] = 10
<span style="color: #228b22;">IndexError</span>: <span style="color: #7a378b;">list</span> assignment index out of <span style="color: #7a378b;">range</span>
&gt;&gt;&gt; mylist[0] = 100
&gt;&gt;&gt; mylist
[100, 2, 3, 4, 5]

<span style="color: #b22222;">#&#21024;&#38500;&#20803;&#32032;</span>
&gt;&gt;&gt; <span style="color: #a020f0;">del</span>(mylist[0])
&gt;&gt;&gt; mylist
[2, 3, 4, 5]
&gt;&gt;&gt;

<span style="color: #b22222;">#&#20998;&#29255;&#36171;&#20540;</span>
&gt;&gt;&gt; mystr = <span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"Nale Gunn"</span>)
&gt;&gt;&gt; mystr[0:4] = <span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"Bill"</span>)
&gt;&gt;&gt; mystr
[<span style="color: #8b2252;">'B'</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">' '</span>, <span style="color: #8b2252;">'G'</span>, <span style="color: #8b2252;">'u'</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'n'</span>]
<span style="color: #b22222;">#&#20998;&#29255;&#36171;&#20540;&#26102;&#65292;&#21407;&#29255;&#19982;&#26032;&#29255;&#38271;&#24230;&#19981;&#21516;</span>
&gt;&gt;&gt; mystr=<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"Bill Gunn"</span>)
&gt;&gt;&gt; mystr[-5:] = <span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"gunn@gmail.com"</span>)
&gt;&gt;&gt; mystr
[<span style="color: #8b2252;">'B'</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">'g'</span>, <span style="color: #8b2252;">'u'</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'@'</span>, <span style="color: #8b2252;">'g'</span>, <span style="color: #8b2252;">'m'</span>, <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">'.'</span>, <span style="color: #8b2252;">'c'</span>, <span style="color: #8b2252;">'o'</span>, <span style="color: #8b2252;">'m'</span>]
&gt;&gt;&gt;
<span style="color: #b22222;">#&#20998;&#29255;&#36171;&#20540;&#21487;&#20197;&#22312;&#25351;&#23450;&#20301;&#32622;&#25554;&#20837;&#26032;&#30340;&#20803;&#32032;</span>
&gt;&gt;&gt; mystr=<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"Bill Gunn"</span>)
&gt;&gt;&gt; mystr[0:0] = <span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"My name is "</span>)
&gt;&gt;&gt; mystr
[<span style="color: #8b2252;">'M'</span>, <span style="color: #8b2252;">'y'</span>, <span style="color: #8b2252;">' '</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'m'</span>, <span style="color: #8b2252;">'e'</span>, <span style="color: #8b2252;">' '</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">' '</span>, <span style="color: #8b2252;">'B'</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">'l'</span>, <span style="color: #8b2252;">' '</span>, <span style="color: #8b2252;">'G'</span>, <span style="color: #8b2252;">'u'</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'n'</span>]
&gt;&gt;&gt;

</pre>




</div>

</div>
