python/BeginningPython2nd/c02.org
** 列表方法
   1. 说明：
      1. append：用于在列表末尾追加一个新的元素；列表调用该方法后，直接被该
         方法修改；
      2. count：用于统计某个元素在列表中出现的次数；
      3. extend：在列表的末尾一次性追加另一个列表中的多个元素，该方法
         也是直接修改原列表，这也是与列表连接操作的区别；
      4. index：找出某个匹配项第一次出现的索引；
      5. insert：在列表中插入新的对象；
      6. pop：移除列表中的一个值（默认是最后一个），并返回该元素的值；
      7. remove：用于移除某个值在列表中的第一个匹配项；
      8. reverse：将列表中的值反向存放；
      9. sort：对列表进行排序；
      10. sorted内建函数：对序列进行反序，并返回一个列表
   2. 注意：
      1. 列表复制：用分片的方法复制比较有效率。
   3. 例子：
#+begin_src python
  #append
  >>> lst = list("Test")
  >>> lst.append(list("String"))
  >>> lst
  ['T', 'e', 's', 't', ['S', 't', 'r', 'i', 'n', 'g']]
  >>> lst.append("String")
  >>> lst
  ['T', 'e', 's', 't', ['S', 't', 'r', 'i', 'n', 'g'], 'String']
  >>> lst=list("Test")
  >>> lst.append("!")
  >>> lst
  ['T', 'e', 's', 't', '!']
  
  #count
  >>> lst.count('T')
  1
  >>> lst.count('t')
  1
  
  #extend
  >>> lst.extend(list("HaHa"))
  >>> lst
  ['T', 'e', 's', 't', '!', 'H', 'a', 'H', 'a']
  >>> lst.index('t')
  3
  >>> 
  
  #pop
  >>> lst = [1,2,3]
  >>> lst.pop()
  3
  >>> lst
  [1, 2]
  >>> lst.pop(0)
  1
  >>> lst
  [2]
  >>> 
  
  #pop
  >>> lst = [1,2,3]
  >>> lst.pop()
  3
  >>> lst
  [1, 2]
  >>> lst.pop(0)
  1
  >>> lst
  [2]
  
  #remove
  >>> lst=list("12345678")
  >>> lst
  ['1', '2', '3', '4', '5', '6', '7', '8']
  #删除不存在的对象会报错
  >>> lst.remove(2)
  Traceback (most recent call last):
    File "<pyshell#42>", line 1, in <module>
      lst.remove(2)
  ValueError: list.remove(x): x not in list
  >>> lst.remove('2')
  >>> lst
  ['1', '3', '4', '5', '6', '7', '8']
  
  #reverse
  >>> lst.reverse()
  >>> lst
  ['8', '7', '6', '5', '4', '3', '1']
  
  #sort
  >>> lst.sort()
  >>> lst
  ['1', '3', '4', '5', '6', '7', '8']
  >>> lst.sort(key=len)
  >>> lst
  ['1', '3', '4', '5', '6', '7', '8']
  >>> lst = ['asdf','qwersf','aaf','s','afasfd','qre']
  >>> lst.sort(key=len)
  >>> lst
  ['s', 'aaf', 'qre', 'asdf', 'qwersf', 'afasfd']
  >>> lst.sort(key=len,reverse=True)
  >>> lst
  ['qwersf', 'afasfd', 'asdf', 'aaf', 'qre', 's']
  >>> 
  
  #列表复制
  >>> x = list('123456')
  #下面的复制，只是让y也指向x指向的对象，所以修改x，也会影响y的值
  >>> y = x
  >>> x.reverse()
  >>> y
  ['6', '5', '4', '3', '2', '1']
  #用分片的方法复制，x与y相互独立，修改x，不会影响y
  >>> y=x[:]
  >>> y.sort()
  >>> x
  ['6', '5', '4', '3', '2', '1']
  >>> y
  ['1', '2', '3', '4', '5', '6']
  >>> 
  
#+end_src

* 元组

** 元组定义：
   1. 说明：元组不可以修改，一般用圆括号括起来
   2. 例子：
#+begin_src python
  #一般元组
  >>> 1,2,3
  (1, 2, 3)
  >>> (1,2,3)
  (1, 2, 3)
  
  #一个元素的元组
  >>> (1,)
  (1,)
  >>> 2,
  (2,)
  
  #空元组
  >>> ()
  ()
  >>> 
  
  #元组的乘法
  >>> 4* (2,)
  (2, 2, 2, 2)
  >>> 
  
#+end_src
** tuple函数
   1. 说明：以一个序列为参数，将其转换为元组；
   2. 例子：

#+begin_src python
  >>> tuple("CONSTANT")
  ('C', 'O', 'N', 'S', 'T', 'A', 'N', 'T')
  >>> tuple(list("CONST"))
  ('C', 'O', 'N', 'S', 'T')
  >>> 
  
#+end_src

** 元组的意义：
   1. 元组可以在映射中当作键使用；
   2. 元组作为很多内建函数和方法的返回值存在。
