python/BeginningPython2nd/c02.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 列表方法 </h3>
<div class="outline-text-3" id="text-3-3">

<ol>
<li>说明：
<ol>
<li>append：用于在列表末尾追加一个新的元素；列表调用该方法后，直接被该
         方法修改；
</li>
<li>count：用于统计某个元素在列表中出现的次数；
</li>
<li>extend：在列表的末尾一次性追加另一个列表中的多个元素，该方法
         也是直接修改原列表，这也是与列表连接操作的区别；
</li>
<li>index：找出某个匹配项第一次出现的索引；
</li>
<li>insert：在列表中插入新的对象；
</li>
<li>pop：移除列表中的一个值（默认是最后一个），并返回该元素的值；
</li>
<li>remove：用于移除某个值在列表中的第一个匹配项；
</li>
<li>reverse：将列表中的值反向存放；
</li>
<li>sort：对列表进行排序；
</li>
<li>sorted内建函数：对序列进行反序，并返回一个列表
</li>
</ol>

</li>
<li>注意：
<ol>
<li>列表复制：用分片的方法复制比较有效率。
</li>
</ol>

</li>
<li>例子：
</li>
</ol>




<pre class="src src-python"><span style="color: #b22222;">#append</span>
&gt;&gt;&gt; lst = <span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"Test"</span>)
&gt;&gt;&gt; lst.append(<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"String"</span>))
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'e'</span>, <span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">'t'</span>, [<span style="color: #8b2252;">'S'</span>, <span style="color: #8b2252;">'t'</span>, <span style="color: #8b2252;">'r'</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'g'</span>]]
&gt;&gt;&gt; lst.append(<span style="color: #8b2252;">"String"</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'e'</span>, <span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">'t'</span>, [<span style="color: #8b2252;">'S'</span>, <span style="color: #8b2252;">'t'</span>, <span style="color: #8b2252;">'r'</span>, <span style="color: #8b2252;">'i'</span>, <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'g'</span>], <span style="color: #8b2252;">'String'</span>]
&gt;&gt;&gt; lst=<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"Test"</span>)
&gt;&gt;&gt; lst.append(<span style="color: #8b2252;">"!"</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'e'</span>, <span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">'t'</span>, <span style="color: #8b2252;">'!'</span>]

<span style="color: #b22222;">#count</span>
&gt;&gt;&gt; lst.count(<span style="color: #8b2252;">'T'</span>)
1
&gt;&gt;&gt; lst.count(<span style="color: #8b2252;">'t'</span>)
1

<span style="color: #b22222;">#extend</span>
&gt;&gt;&gt; lst.extend(<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"HaHa"</span>))
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'e'</span>, <span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">'t'</span>, <span style="color: #8b2252;">'!'</span>, <span style="color: #8b2252;">'H'</span>, <span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'H'</span>, <span style="color: #8b2252;">'a'</span>]
&gt;&gt;&gt; lst.index(<span style="color: #8b2252;">'t'</span>)
3
&gt;&gt;&gt; 

<span style="color: #b22222;">#pop</span>
&gt;&gt;&gt; lst = [1,2,3]
&gt;&gt;&gt; lst.pop()
3
&gt;&gt;&gt; lst
[1, 2]
&gt;&gt;&gt; lst.pop(0)
1
&gt;&gt;&gt; lst
[2]
&gt;&gt;&gt; 

<span style="color: #b22222;">#pop</span>
&gt;&gt;&gt; lst = [1,2,3]
&gt;&gt;&gt; lst.pop()
3
&gt;&gt;&gt; lst
[1, 2]
&gt;&gt;&gt; lst.pop(0)
1
&gt;&gt;&gt; lst
[2]

<span style="color: #b22222;">#remove</span>
&gt;&gt;&gt; lst=<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"12345678"</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'7'</span>, <span style="color: #8b2252;">'8'</span>]
<span style="color: #b22222;">#&#21024;&#38500;&#19981;&#23384;&#22312;&#30340;&#23545;&#35937;&#20250;&#25253;&#38169;</span>
&gt;&gt;&gt; lst.remove(2)
Traceback (most recent call last):
  File <span style="color: #8b2252;">"&lt;pyshell#42&gt;"</span>, line 1, <span style="color: #a020f0;">in</span> &lt;module&gt;
    lst.remove(2)
<span style="color: #228b22;">ValueError</span>: <span style="color: #7a378b;">list</span>.remove(x): x <span style="color: #a020f0;">not</span> <span style="color: #a020f0;">in</span> <span style="color: #7a378b;">list</span>
&gt;&gt;&gt; lst.remove(<span style="color: #8b2252;">'2'</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'7'</span>, <span style="color: #8b2252;">'8'</span>]

<span style="color: #b22222;">#reverse</span>
&gt;&gt;&gt; lst.reverse()
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'8'</span>, <span style="color: #8b2252;">'7'</span>, <span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'1'</span>]

<span style="color: #b22222;">#sort</span>
&gt;&gt;&gt; lst.sort()
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'7'</span>, <span style="color: #8b2252;">'8'</span>]
&gt;&gt;&gt; lst.sort(key=<span style="color: #7a378b;">len</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'7'</span>, <span style="color: #8b2252;">'8'</span>]
&gt;&gt;&gt; lst = [<span style="color: #8b2252;">'asdf'</span>,<span style="color: #8b2252;">'qwersf'</span>,<span style="color: #8b2252;">'aaf'</span>,<span style="color: #8b2252;">'s'</span>,<span style="color: #8b2252;">'afasfd'</span>,<span style="color: #8b2252;">'qre'</span>]
&gt;&gt;&gt; lst.sort(key=<span style="color: #7a378b;">len</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'s'</span>, <span style="color: #8b2252;">'aaf'</span>, <span style="color: #8b2252;">'qre'</span>, <span style="color: #8b2252;">'asdf'</span>, <span style="color: #8b2252;">'qwersf'</span>, <span style="color: #8b2252;">'afasfd'</span>]
&gt;&gt;&gt; lst.sort(key=<span style="color: #7a378b;">len</span>,reverse=<span style="color: #a020f0;">True</span>)
&gt;&gt;&gt; lst
[<span style="color: #8b2252;">'qwersf'</span>, <span style="color: #8b2252;">'afasfd'</span>, <span style="color: #8b2252;">'asdf'</span>, <span style="color: #8b2252;">'aaf'</span>, <span style="color: #8b2252;">'qre'</span>, <span style="color: #8b2252;">'s'</span>]
&gt;&gt;&gt; 

<span style="color: #b22222;">#&#21015;&#34920;&#22797;&#21046;</span>
&gt;&gt;&gt; x = <span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">'123456'</span>)
<span style="color: #b22222;">#&#19979;&#38754;&#30340;&#22797;&#21046;&#65292;&#21482;&#26159;&#35753;y&#20063;&#25351;&#21521;x&#25351;&#21521;&#30340;&#23545;&#35937;&#65292;&#25152;&#20197;&#20462;&#25913;x&#65292;&#20063;&#20250;&#24433;&#21709;y&#30340;&#20540;</span>
&gt;&gt;&gt; y = x
&gt;&gt;&gt; x.reverse()
&gt;&gt;&gt; y
[<span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'1'</span>]
<span style="color: #b22222;">#&#29992;&#20998;&#29255;&#30340;&#26041;&#27861;&#22797;&#21046;&#65292;x&#19982;y&#30456;&#20114;&#29420;&#31435;&#65292;&#20462;&#25913;x&#65292;&#19981;&#20250;&#24433;&#21709;y</span>
&gt;&gt;&gt; y=x[:]
&gt;&gt;&gt; y.sort()
&gt;&gt;&gt; x
[<span style="color: #8b2252;">'6'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'1'</span>]
&gt;&gt;&gt; y
[<span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'4'</span>, <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'6'</span>]
&gt;&gt;&gt; 

</pre>




</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 元组 </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 元组定义： </h3>
<div class="outline-text-3" id="text-4-1">

<ol>
<li>说明：元组不可以修改，一般用圆括号括起来
</li>
<li>例子：
</li>
</ol>




<pre class="src src-python"><span style="color: #b22222;">#&#19968;&#33324;&#20803;&#32452;</span>
&gt;&gt;&gt; 1,2,3
(1, 2, 3)
&gt;&gt;&gt; (1,2,3)
(1, 2, 3)

<span style="color: #b22222;">#&#19968;&#20010;&#20803;&#32032;&#30340;&#20803;&#32452;</span>
&gt;&gt;&gt; (1,)
(1,)
&gt;&gt;&gt; 2,
(2,)

<span style="color: #b22222;">#&#31354;&#20803;&#32452;</span>
&gt;&gt;&gt; ()
()
&gt;&gt;&gt; 

<span style="color: #b22222;">#&#20803;&#32452;&#30340;&#20056;&#27861;</span>
&gt;&gt;&gt; 4* (2,)
(2, 2, 2, 2)
&gt;&gt;&gt; 

</pre>



</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> tuple函数 </h3>
<div class="outline-text-3" id="text-4-2">

<ol>
<li>说明：以一个序列为参数，将其转换为元组；
</li>
<li>例子：
</li>
</ol>





<pre class="src src-python">&gt;&gt;&gt; <span style="color: #7a378b;">tuple</span>(<span style="color: #8b2252;">"CONSTANT"</span>)
(<span style="color: #8b2252;">'C'</span>, <span style="color: #8b2252;">'O'</span>, <span style="color: #8b2252;">'N'</span>, <span style="color: #8b2252;">'S'</span>, <span style="color: #8b2252;">'T'</span>, <span style="color: #8b2252;">'A'</span>, <span style="color: #8b2252;">'N'</span>, <span style="color: #8b2252;">'T'</span>)
&gt;&gt;&gt; <span style="color: #7a378b;">tuple</span>(<span style="color: #7a378b;">list</span>(<span style="color: #8b2252;">"CONST"</span>))
(<span style="color: #8b2252;">'C'</span>, <span style="color: #8b2252;">'O'</span>, <span style="color: #8b2252;">'N'</span>, <span style="color: #8b2252;">'S'</span>, <span style="color: #8b2252;">'T'</span>)
&gt;&gt;&gt; 

</pre>




</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 元组的意义： </h3>
<div class="outline-text-3" id="text-4-3">

<ol>
<li>元组可以在映射中当作键使用；
</li>
<li>元组作为很多内建函数和方法的返回值存在。
</li>
</ol>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-11-14 09:28:51 </p>
<p class="author">Author: </p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
